-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 24 2022 г., 14:18
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `workplace`
--

-- --------------------------------------------------------

--
-- Структура таблицы `receipt`
--

CREATE TABLE `receipt` (
  `id` int(11) NOT NULL COMMENT 'Идентификатор',
  `date` date NOT NULL COMMENT 'Дата поступления',
  `number` varchar(15) NOT NULL COMMENT 'Номер поступления',
  `sum` double(10,2) NOT NULL COMMENT 'Сумма поступления',
  `vat` double(4,2) DEFAULT NULL COMMENT 'НДС (Без нДС - 1, 20% - 1,2)',
  `partner` varchar(255) NOT NULL COMMENT 'Контрагент',
  `num_doc` varchar(20) DEFAULT NULL COMMENT 'Номер входящего документа',
  `date_doc` date DEFAULT NULL COMMENT 'Дата входящего документа',
  `note` varchar(255) DEFAULT NULL COMMENT 'Примечание',
  `num_pay` varchar(100) DEFAULT NULL COMMENT 'Номер ЗО (заполняется когда появляется ЗО)',
  `date_pay` varchar(100) DEFAULT NULL COMMENT 'Дата оплаты (заполняется когда фактически происходит оплата)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Поступления товаров и услуг';

--
-- Дамп данных таблицы `receipt`
--

INSERT INTO `receipt` (`id`, `date`, `number`, `sum`, `vat`, `partner`, `num_doc`, `date_doc`, `note`, `num_pay`, `date_pay`) VALUES
(34, '2022-01-02', 'TOF00000038', 1232.03, 1.20, 'РН-Карт ООО', '12-89925/507', '2021-12-31', 'ISS144703   ГСМ за декабрь', 'TOF00000021/2022', '2022-01-19'),
(35, '2022-01-02', 'TOF00000020', 6000.00, 1.00, 'Аквамир Компания ООО', '137', '2021-12-02', '', 'TOF00000025/2022', '2022-01-21'),
(36, '2022-01-02', 'TOF00000029', 15600.00, 1.00, 'Благоустройство и Содержание ООО', '11053', '2021-12-31', 'без НДС', 'TOF00000030/2022', '2022-01-26'),
(37, '2022-01-02', 'TOF00000030', 17944.92, 1.20, 'ЭкоСтройРесурс ООО', 'КУ12-018160', '2021-12-31', '', 'TOF00000009/2022', '2022-01-17'),
(38, '2022-01-02', 'TOF00000031', 6556.50, 1.20, 'Почта России АО УФПС Самарской области', '054023у00029425', '2021-12-31', '', 'TOF00000050/2022;TOF00000051/2022;TOF00000052/2022', '2022-02-10'),
(39, '2022-01-02', 'TOF00000036', 4007.52, 1.20, 'ВымпелКом ПАО', 'Б/н', '2021-12-31', 'счет 012-RP310', 'TOF00000032/2022', '2022-01-31'),
(40, '2022-01-02', 'TOF00000037', 2624.34, 1.20, 'ВымпелКом ПАО', '100848203356', '2021-12-31', 'мобил. связь', 'TOF00000033/2022', '2022-01-31'),
(41, '2022-01-02', 'TOF00000039', 190.04, 1.00, 'Акимов Вадим Анатольевич', '2', '2021-12-31', 'декабрь 2021', 'TOF00000022/2022', '2022-01-20'),
(42, '2022-01-02', 'TOF00000051', 39780.00, 1.20, 'МСК ООО', '249', '2021-12-31', 'Услуги по аустафингу', NULL, NULL),
(43, '2022-01-02', 'TOF00000058', 79980.00, 1.00, 'Благоустройство и Содержание ООО', '11320', '2021-12-31', 'биоотходы  без НДС', 'TOF00000030/2022', '2022-01-26'),
(44, '2022-01-02', 'TOF00000075', 2998.00, 1.20, 'Самарское ветеринарное объединение ГБУ СО', '00ГУ-014204', '2021-12-01', '', 'TOF00000036/2022', '2022-02-01'),
(46, '2022-01-10', 'TOF00000009', 32247.60, 1.20, 'Промэнерго Автоматика ООО', '27165', '2021-12-24', '', 'CNT00000155/2022', '2022-01-31'),
(47, '2022-01-10', 'TOF00000013', 6500.00, 1.00, 'Гидродинамика ООО', '3', '2022-01-10', 'без НДС', 'TOF00000029/2022', '2022-01-26'),
(48, '2022-01-11', 'TOF00000021', 25480.58, 1.20, 'Актрос Компания ООО', '778', '2021-12-24', '', 'CNT00008165/2022', '2022-01-26'),
(49, '2022-01-11', 'TOF00000022', 2640.00, 1.20, 'Актрос Компания ООО', '781', '2021-12-24', '', 'CNT00008164/2022', '2022-01-27'),
(50, '2022-01-11', 'TOF00000023', 95527.65, 1.00, 'СТРОЙАРТМОНТАЖ ООО', '1', '2022-01-11', 'Без НДС, замена напольного покрытия', 'TOF00000035/2022', '2022-01-28'),
(51, '2022-01-12', 'TOF00000024', 182645.00, 1.00, 'СТРОЙАРТМОНТАЖ ООО', '2', '2022-01-12', 'Без НДС, замена напольного покрытия', 'TOF00000035/2022', '2022-01-28'),
(52, '2022-01-12', 'TOF00000043', 41850.00, 1.00, 'ЦЕНТР МЕДОСМОТРОВ ООО', '28', '2022-01-12', 'без НДС', 'TOF00000026/2022', '2022-01-25'),
(53, '2022-01-18', 'TOF00000047', 28893.40, 1.20, 'Прогресс-Юг ООО', '10', '2022-01-10', '', 'CNT00009056/2022', '2022-02-17'),
(54, '2022-01-21', 'TOF00000077', 13500.00, 1.00, 'Сазанов Алексей Валерьевич ИП', '21', '2022-01-21', 'без НДС', 'TOF00000040/2022', '2022-02-07'),
(55, '2022-01-21', 'TOF00000078', 100800.00, 1.20, 'АЛМЕКО ООО', '1', '2022-01-21', '', 'TOF00000039/2022', '2022-02-07'),
(56, '2022-01-24', 'TOF00000076', 6480.00, 1.00, 'Гидродинамика ООО', '18', '2022-01-24', 'без НДС', 'TOF00000042/2022', '2022-02-09'),
(57, '2022-01-24', 'TOF00000086', 12600.00, 1.00, 'Гидродинамика ООО', '19', '2022-01-24', 'без НДС', 'TOF00000042/2022', '2022-02-09'),
(58, '2022-01-25', 'TOF00000068', 14299.49, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/5022386-21', '2022-01-25', '', 'TOF00000045/2022', '2022-02-15'),
(59, '2022-01-25', 'TOF00000069', 4855.27, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/5022694-1', '2022-01-25', '', 'TOF00000045/2022', '2022-02-15'),
(60, '2022-01-26', 'TOF00000079', 29998.14, 1.20, 'Канцона Плюс ООО', '457', '2022-01-25', '', 'TOF00000041/2022', '2022-02-10'),
(61, '2022-01-30', 'TOF00000074', 2998.00, 1.20, 'Самарское ветеринарное объединение ГБУ СО', '00ГУ-000124', '2022-01-30', '', 'TOF00000063/2022', NULL),
(62, '2022-01-31', 'TOF00000097', 22100.00, 1.20, 'Петро-Самара ООО', '38', '2022-01-31', '', NULL, NULL),
(63, '2022-01-31', 'TOF00000054', 49500.00, 1.20, 'ВОЛГА ХОЛОД ИНЖИНИРИНГ ООО', '57', '2022-01-31', 'Упд', 'TOF00000043/2022', '2022-02-16'),
(64, '2022-01-31', 'TOF00000070', 21360.00, 1.20, 'Тандер АО', 'TANGKC-000227', '2022-01-31', 'ФСБУ 25 Аренда БУ Дт 76.07.1 Кт 76.07.2 1!!! см ФСБУ 25', 'TOF00000044/2022', '2022-02-08'),
(65, '2022-01-31', 'TOF00000106', 22400.00, 1.20, 'Фортуна ООО', '21', '2022-01-31', 'Питание январь 2022год', NULL, NULL),
(66, '2022-01-31', 'TOF00000107', 113580.40, 1.20, 'Тандер АО', 'TANCNT-015075', '2022-01-31', '', 'TOF00000064/2022', '2022-02-21'),
(67, '2022-02-01', 'TOF00000105', 45708.00, 1.20, 'ТЕХНОСИСТЕМА ООО', '9309', '2022-02-01', '', 'TOF00000054/2022', '2022-02-11'),
(68, '2022-02-01', 'TOF00000113', 94928.00, 1.20, 'ВСС ООО', '398', '2022-02-01', '', 'TOF00000059/2022', NULL),
(69, '2022-02-01', 'TOF00000116', 27478.00, 1.20, 'Прогресс-Юг ООО', '109', '2022-01-24', '', '', NULL),
(70, '2022-02-01', 'TOF00000124', 320400.00, 1.20, 'Балтик Мастер МСК ООО', '117004', '2022-01-17', '', 'CNT00008811/2022', '2022-02-16'),
(71, '2022-02-01', 'TOF00000125', 29920.00, 1.20, 'ВТМ-БЕЛТ ООО', '97', '2022-01-24', '', 'CNT00008871/2022', '2022-02-21'),
(72, '2022-02-01', 'TOF00000149', 874.76, 1.20, 'РН-Карт ООО', '1-78771/507', '2022-01-31', 'ISS144703    ГСМ за январь 2022г.', 'TOF00000056/2022', '2022-02-11'),
(73, '2022-02-01', 'TOF00000156', 2659.16, 1.20, 'ВСС ООО', '6976', '2021-12-29', '', 'TOF00000059/2022', NULL),
(74, '2022-02-01', 'TOF00000115', 5000.00, 1.20, 'Спасатель ООО', '766', '2022-01-31', '', 'TOF00000046/2022', '2022-02-16'),
(75, '2022-02-01', 'TOF00000126', 232500.00, 1.00, 'Малюский Лев Феодосиевич ИП', '4', '2022-01-31', 'Без НДС', 'TOF00000049/2022', '2022-02-17'),
(76, '2022-02-01', 'TOF00000139', 4894.02, 1.20, 'Почта России АО УФПС Самарской области', '054023у00001712', '2022-01-31', '', '', NULL),
(77, '2022-02-01', 'TOF00000143', 4007.52, 1.20, 'ВымпелКом ПАО', 'Б/Н', '2022-01-31', '', 'TOF00000060/2022', NULL),
(78, '2022-02-01', 'TOF00000144', 2624.34, 1.20, 'ВымпелКом ПАО', '100856384150', '2022-01-31', 'мобил. связь', 'TOF00000061/2022', NULL),
(79, '2022-02-01', 'TOF00000148', 127.28, 1.00, 'Акимов Вадим Анатольевич', '1', '2022-01-31', 'январь 2022', 'TOF00000057/2022', '2022-02-11'),
(80, '2022-02-01', 'TOF00000150', 24975.00, 1.00, 'ИНФО СВЕТ ООО', '5', '2022-01-31', 'Без НДС', 'TOF00000070/2022', NULL),
(81, '2022-02-02', 'TOF00000128', 1907.20, 1.20, 'Три Нити ООО', '2', '2022-02-02', '', 'TOF00000048/2022', '2022-02-10'),
(82, '2022-02-02', 'TOF00000141', 35100.00, 1.00, 'ЦЕНТР МЕДОСМОТРОВ ООО', '129', '2022-02-02', 'без НДС', 'TOF00000053/2022', '2022-02-11'),
(83, '2022-02-03', 'TOF00000127', 15000.00, 1.00, 'СТРОЙАРТМОНТАЖ ООО', '4', '2022-02-03', 'Без НДС, замена напольного покрытия', 'TOF00000055/2022', '2022-02-21'),
(84, '2022-02-03', 'TOF00000142', 107910.00, 1.00, 'СТРОЙАРТМОНТАЖ ООО', '3', '2022-02-03', 'Без НДС, замена напольного покрытия', 'TOF00000055/2022', '2022-02-21'),
(85, '2022-02-07', 'TOF00000140', 119180.00, 1.20, 'Авант-подшипник ТД ООО', '266', '2022-01-28', '', 'CNT00008946/2022', NULL),
(86, '2022-02-10', 'TOF00000157', 46954.00, 1.20, 'Вектон-Центр ООО', '5010', '2021-11-24', NULL, 'TOF00000062/2022', NULL),
(87, '2022-02-01', 'TOF00000158', 35889.84, 1.20, 'ЭкоСтройРесурс ООО', 'КУ01-016788', '2022-01-31', NULL, 'TOF00000066/2022', '2022-02-21'),
(88, '2022-02-01', 'TOF00000175', 3000.00, 1.20, 'Самара-Дез ООО', '432', '2021-11-25', NULL, 'TOF00000065/2022', NULL),
(89, '2022-02-10', 'TOF00000176', 3000.00, 1.20, 'Самара-Дез ООО', '46', '2022-02-10', NULL, NULL, NULL),
(90, '2022-02-14', 'TOF00000168', 2952.00, 1.20, 'ВсеИнструменты.ру ООО', '0595167-ТОЛ', '2022-02-13', NULL, NULL, NULL),
(91, '2022-01-31', 'TTF00001360', 223200.00, 1.20, 'Император ОО ООО', '59', '2022-01-31', NULL, 'TTF00044610/2022', '2022-02-14'),
(92, '2022-02-09', 'TOF00000181', 33486.00, 1.20, 'ВТМ-БЕЛТ ООО', '224', '2022-02-03', NULL, 'CNT00009358/2022', NULL),
(93, '2022-02-14', 'TOF00000182', 41481.54, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/7053686484', '2022-02-14', NULL, 'CNT00009357/2022', NULL),
(94, '2022-02-14', 'TOF00000183', 5274.35, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/5022694', '2022-02-14', NULL, 'CNT00009357/2022', NULL),
(95, '2022-02-14', 'TOF00000184', 1422.34, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/5022386-20', '2022-02-14', NULL, 'CNT00009357/2022', NULL),
(96, '2022-02-14', 'TOF00000185', 22841.90, 1.20, 'ЭЛЕКТРОТЕХМОНТАЖ ТД ООО', '430/5022894-2', '2022-02-14', NULL, 'CNT00009357/2022', NULL),
(97, '2022-02-01', 'TOF00000187', 3000.00, 1.00, 'ЮгИнтеграция ООО', '92', '2020-09-14', NULL, 'TOF00000067/2022', '2022-02-22'),
(98, '2022-02-18', 'TOF00000207', 216000.00, 1.20, 'АЛМЕКО ООО', '4', '2022-02-18', NULL, 'TOF00000072/2022', NULL),
(100, '2022-02-01', 'TOF00000208', 36000.00, 1.00, 'ВОЛГАКОМСЕРВИС ООО', '2368', '2021-12-28', 'Без НДС', NULL, NULL),
(103, '2022-02-02', 'TOF00000211', 36000.00, 1.20, 'ВОЛГАКОМСЕРВИС ООО', '111', '2022-02-02', 'Без НДС', NULL, NULL),
(104, '2022-02-14', 'TOF00000212', 4000.00, 1.20, 'МАСТЕР ВОРОТ ООО', '86', '2022-02-14', '', NULL, NULL),
(105, '2022-02-14', 'TOF00000213', 18000.00, 1.20, 'МАСТЕР ВОРОТ ООО', '25', '2022-01-20', '', NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `receipt`
--
ALTER TABLE `receipt`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `receipt`
--
ALTER TABLE `receipt`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=106;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
